package demo.tool.other.service.impl;

import java.util.Arrays;
import java.util.List;
import java.util.concurrent.ThreadLocalRandom;

public class RandomChineseNameGenerator {

	public String getRandomFirstName() {
		List<String> firstName = Arrays.asList("詠晴", "玉英", "玉", "玉兰", "品妤", "佩珊", "嘉雯", "明", "俊傑", "俊宏", "金水", "文雄",
				"怡君", "志成", "武雄", "柏宇", "語彤", "家辉", "志明", "美惠", "可欣", "宥辰", "宇恒", "淑惠", "志伟", "宇翔", "雅惠", "麗華", "思妤",
				"宜蓁", "诗涵", "子晴", "嘉欣", "淑華", "美玉", "进财", "丽华", "伟杰", "秀英", "雅婷", "秀美", "宥翔", "睿恩", "禹彤", "承恩", "羽彤",
				"宇恩", "芷萱", "志強", "正雄", "宸睿", "金龍", "咏晴", "健伟", "家乐", "欣怡", "品睿", "雅雯", "志偉", "家勇", "荣华", "佩君", "冠廷",
				"承翰", "建宏", "思敏", "芯語", "家俊", "淑貞", "淑娟", "健", "品妍", "美玲", "欣妤", "俊杰", "冠宇", "英", "静宜", "淑芬", "宥廷",
				"金龙", "秀琴", "金生", "怡婷", "恩綺", "家豪", "志豪");
		ThreadLocalRandom t = ThreadLocalRandom.current();
		int i = t.nextInt(0, firstName.size());
		return firstName.get(i);
	}

	public String getRandomLastName() {
		List<String> lastName = Arrays.asList("丁", "范", "万", "慕容", "程", "夏", "唐", "向", "崔", "吕", "刘", "张", "蔡", "谢",
				"尤", "严", "萧", "欧", "温", "洪", "倪", "谭", "阮", "田", "朱", "吴", "戴", "游", "尹", "贺", "锺", "贾", "陆", "陈", "李",
				"魏", "卓", "孔", "何", "赖", "罗", "潘", "孙", "余", "杜", "孟", "江", "卢", "董", "汤", "武", "令狐", "贺兰", "杨", "周",
				"汪", "马", "彭", "诸葛", "赵", "陶", "詹", "白", "顾", "司马", "简", "梁", "袁", "涂", "覃", "申屠", "庄", "傅", "沈", "熊",
				"皇甫", "王", "宋", "蒋", "夏侯", "于", "徐", "司徒", "邓", "林", "龙", "龚", "薛", "完颜", "颜", "钟", "长孙", "纪", "莫", "冯",
				"侯", "邱", "钱", "段", "邵", "康", "许", "方", "邹", "施", "翁", "黃", "凃", "黄", "上官", "黎", "苏", "郑", "金", "廖",
				"高", "付", "姚", "毛", "姜", "郝", "蓝", "连", "胡", "欧阳", "古", "童", "韦", "秦", "韩", "闫", "巫", "郭", "柯", "史",
				"石", "柳", "叶", "雷", "曹", "任", "尉迟", "曾");
		ThreadLocalRandom t = ThreadLocalRandom.current();
		int i = t.nextInt(0, lastName.size());
		return lastName.get(i);
	}
}
